recept/src/Documents/КоррекцияОстатков/КоррекцияОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КоррекцияОстатков</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коррекция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/Documents/КоррекцияОстатков/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;	

	//Получает остаток из регистра
	СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.Номенклатура); 
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент) 
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;	

	//Получает остаток из регистра
	СтрокаТабличнойЧасти.Коррекция =  СтрокаТабличнойЧасти.Количество - СтрокаТабличнойЧасти.Остаток;   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьизExcel(Команда)
	Форма = ПолучитьФорму("Документ.КоррекцияОстатков.Форма.ФормаЗагрузкиТаблицыИзExcel",,ЭтотОбъект);
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Для Каждого Строка ИЗ ВыбранноеЗначение Цикл
		Если Строка.Остаток <> Строка.ОстатокВ1С Тогда
			НоваяСтрока 				= Объект.Материалы.Добавить();     
		   	НоваяСтрока.Номенклатура 	= Строка.Номенклатура;
			НоваяСтрока.Количество	 	= Строка.Остаток;
			НоваяСтрока.Остаток 		= Строка.ОстатокВ1С;
			НоваяСтрока.Коррекция		= Строка.Остаток - Строка.ОстатокВ1С;
		КонецЕсли
	КонецЦикла; 
КонецПроцедуры
